; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 6743)
	(= (fuel plane1) 2362)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city0)
	(= (capacity plane2) 11019)
	(= (fuel plane2) 2517)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 12)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city2)
	(= (capacity plane3) 10300)
	(= (fuel plane3) 544)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 13)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at person1 city3)
	(at person2 city3)
	(at person3 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 574)
	(= (distance city0 city2) 870)
	(= (distance city0 city3) 765)
	(= (distance city0 city4) 689)
	(= (distance city1 city0) 574)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 827)
	(= (distance city1 city3) 695)
	(= (distance city1 city4) 846)
	(= (distance city2 city0) 870)
	(= (distance city2 city1) 827)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 685)
	(= (distance city2 city4) 789)
	(= (distance city3 city0) 765)
	(= (distance city3 city1) 695)
	(= (distance city3 city2) 685)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 830)
	(= (distance city4 city0) 689)
	(= (distance city4 city1) 846)
	(= (distance city4 city2) 789)
	(= (distance city4 city3) 830)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city3)
	(at person1 city2)
	(at person2 city3)
	(at person3 city4)
	))

(:metric minimize (+ (* 5 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (fly plane1 city0 city4)
   deleted: (at plane1 city0)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 0 to 2067, (fuel plane1) from 2362 to 295
   goals met: 1 of 4
2. (refuel plane3 city2)
   changed: (fuel plane3) from 544 to 10300
   goals met: 1 of 4
3. (refuel plane2 city0)
   changed: (fuel plane2) from 2517 to 11019
   goals met: 1 of 4
4. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 4
5. (fly plane2 city0 city4)
   deleted: (at plane2 city0)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 2067 to 5512, (fuel plane2) from 11019 to 7574
   goals met: 1 of 4
6. (debark person3 plane2 city4)
   deleted: (in person3 plane2)
   added: (at person3 city4)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 4
7. (fly plane3 city2 city3)
   deleted: (at plane3 city2)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 5512 to 8252, (fuel plane3) from 10300 to 7560
   goals met: 3 of 4
8. (board person1 plane3 city3)
   deleted: (at person1 city3)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 3 of 4
9. (fly plane3 city3 city2)
   deleted: (at plane3 city3)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 8252 to 10992, (fuel plane3) from 7560 to 4820
   goals met: 2 of 4
10. (debark person1 plane3 city2)
   deleted: (in person1 plane3)
   added: (at person1 city2)
   changed: (onboard plane3) from 1 to 0
   goals met: 3 of 4
11. (fly plane3 city2 city3)
   deleted: (at plane3 city2)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 10992 to 13732, (fuel plane3) from 4820 to 2080
   goals met: 4 of 4
